Revit 2024 API
PlasticVinyl Members
The PlasticVinyl type exposes the following members.
Properties
Name | Description
CommonTintColor
 The property labeled "Tint Color" from the "PlasticVinyl" schema.
CommonTintToggle
 The property labeled "Tint" from the "PlasticVinyl" schema.
PlasticvinylApplication
 The property labeled "Finish" from the "PlasticVinyl" schema.
PlasticvinylBump
 The property labeled "Finish Bumps" from the "PlasticVinyl" schema.
PlasticvinylBumpAmount
 The property labeled "Amount" from the "PlasticVinyl" schema.
PlasticvinylBumpMap
 The property labeled "Image" from the "PlasticVinyl" schema.
PlasticvinylColor
 The property labeled "Color" from the "PlasticVinyl" schema.
PlasticvinylColorByObject
 The property labeled "Color By Object" from the "PlasticVinyl" schema.
PlasticvinylPattern
 The property labeled "Relief Pattern" from the "PlasticVinyl" schema.
PlasticvinylPatternAmount
 The property labeled "Amount" from the "PlasticVinyl" schema.
PlasticvinylPatternMap
 The property labeled "Image" from the "PlasticVinyl" schema.
PlasticvinylType
 The property labeled "Type" from the "PlasticVinyl" schema.
See Also
PlasticVinyl Class
Autodesk.Revit.DB.Visual Namespace